Revit 2024 API
StructuralSectionUtils.SetStructuralSection Method
 Set structural section in element.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public static bool SetStructuralSection(
	Document document,
	ElementId familySymbolId,
	StructuralSection structuralSection
)
Visual Basic
Public Shared Function SetStructuralSection ( _
	document As Document, _
	familySymbolId As ElementId, _
	structuralSection As StructuralSection _
) As Boolean
Visual C++
public:
static bool SetStructuralSection(
	Document^ document,
	ElementId^ familySymbolId,
	StructuralSection^ structuralSection
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document that owns the family for beam, brace or structural column.
familySymbolId
Type: Autodesk.Revit.DB.ElementId
 ID of family symbol for beam, brace or structural column.
structuralSection
Type: Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Structural section with values that will be set.
Return Value
 True is returned when requested shape with values was properly set. Return false otherwise.
Remarks
 Only beams, braces and structural columns can have structural section associated with it.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
StructuralSectionUtils Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace